
class text(object):
    START = """{},

ɪ ᴄᴀɴ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴀᴘᴘʀᴏᴠᴇ ɴᴇᴡ ᴀs ᴡᴇʟʟ ᴀs ᴘᴇɴᴅɪɴɢ ᴊᴏɪɴ ʀᴇǫᴜᴇsᴛ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟs ᴏʀ ɢʀᴏᴜᴘs.

ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟs ᴀɴᴅ ɢʀᴏᴜᴘs ᴡɪᴛʜ ᴘᴇʀᴍɪssɪᴏɴ ᴛᴏ ᴀᴅᴅ ɴᴇᴡ ᴍᴇᴍʙᴇʀs.

<blockquote><b>‣ 𝖬𝖺𝗂𝗇𝗍𝖺𝗂𝗇𝖾𝖽 𝖡𝗒: <a href='https://t.me/Mahabul201201'>moon</a></b></blockquote>"""

    LOG = """👁️‍🗨️ 𝘜𝘚𝘌𝘙 𝘋𝘌𝘛𝘈𝘐𝘓𝘚

○ 𝘐𝘋 : <code>{}</code>
○ 𝘋𝘊 : {}
○ 𝘍𝘪𝘳𝘴𝘵 𝘕𝘢𝘮𝘦 : {}
○ 𝘜𝘴𝘦𝘳𝘕𝘢𝘮𝘦 : {}

𝘉𝘺 = @{}"""

    ABOUT = """<b>‣ ᴍʏ ɴᴀᴍᴇ :</b> <a href='@AutoApprove_v2Bot'>ᴀᴘᴘʀᴏᴠᴇ ʙᴏᴛ</a>
<b>‣ ʟɪʙʀᴀʀʏ :</b> <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ</a>
<b>‣ ᴅᴀᴛᴀʙᴀsᴇ :</b> <a href='https://www.mongodb.com/'>ᴍᴏɴɢᴏᴅʙ</a>
<b>‣ ʟᴀɴɢᴜᴀɢᴇ :</b> <a href='https://www.python.org/download/releases/3.0/'>ᴘʏᴛʜᴏɴ 𝟹</a>
<b>‣ ʙᴏᴛ sᴇʀᴠᴇʀ :</b> <a href='https://www.koyeb.com/'>ᴋᴏʏᴇʙ</a>
<b>‣ ᴄʀᴇᴀᴛᴇᴅ ʙʏ :</b> <a href='https://telegram.me/Mahabul201'>ᴍᴏᴏɴ</a>"""

    HELP = """{},

ʀᴇᴀᴅ ᴛʜɪs ᴍᴇssᴀɢᴇ ᴄᴀʀᴇғᴜʟʟʏ sᴏ ʏᴏᴜ ᴅᴏɴ'ᴛ ʜᴀᴠᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍs ᴡʜɪʟᴇ ᴜsɪɴɢ ᴍᴇ.

𝟷. ʜᴏᴡ ᴛᴏ ᴀᴄᴄᴇᴘᴛ ɴᴇᴡ ᴊᴏɪɴ ʀᴇǫᴜᴇsᴛs?
➥ ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴏʀ ɢʀᴏᴜᴘ ᴀs ᴀᴅᴍɪɴ ᴀɴᴅ ᴡɪᴛʜ ᴘᴇʀᴍɪssɪᴏɴ ᴛᴏ ᴀᴅᴅ ɴᴇᴡ ᴍᴇᴍʙᴇʀs.

𝟸. ʜᴏᴡ ᴛᴏ ᴀᴄᴄᴇᴘᴛ ᴘᴇɴᴅɪɴɢ ᴊᴏɪɴ ʀᴇǫᴜᴇsᴛs?
➥ ғɪʀsᴛ ᴀᴅᴅ ᴍᴇ ᴀs ᴀᴅᴍɪɴ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴏʀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴘᴇʀᴍɪssɪᴏɴ ᴛᴏ ᴀᴅᴅ ɴᴇᴡ ᴍᴇᴍʙᴇʀs.
➥ ᴛʜᴇɴ ʟᴏɢɪɴ ɪɴᴛᴏ ᴛʜᴇ ʙᴏᴛ ᴍʏ ᴜsɪɴɢ /ʟᴏɢɪɴ ᴄᴏᴍᴍᴀɴᴅ.
➥ ɴᴏᴡ ᴜsᴇ /ᴀᴄᴄᴇᴘᴛ ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴀᴄᴄᴇᴘᴛ ᴀʟʟ ᴘᴇɴᴅɪɴɢ ʀᴇǫᴜᴇsᴛs.
➥ ɴᴏᴡ ᴊᴜsᴛ ᴜsᴇ /ʟᴏɢᴏᴜᴛ ᴄᴏᴍᴍᴀɴᴅ ғᴏʀ ʟᴏɢᴏᴜᴛ.

𝟹. ʜᴏᴡ ᴛᴏ ᴄᴀɴᴄᴇʟ ᴀ ᴘʀᴏᴄᴇss?
➥ ᴜsᴇ /ᴄᴀɴᴄᴇʟ ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ sᴛᴏᴘ ᴀɴʏ ᴏɴɢᴏɪɴɢ ᴘʀᴏᴄᴇss.

<blockquote>sᴛɪʟʟ ʜᴀᴠᴇ ɪssᴜᴇs? ᴜsᴇ /ʜᴇʟᴘ</blockquote>"""
    
